nc: 1

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 1, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 1, C3k2, [512, True]]
  - [-1, 1, SPPF, [512, 5]]
  - [-1, 1, C2PSA, [512]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [512, 512]]
  - [-1, 1, C3k2, [512, False]]
  - [-1, 1, ECA, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [512, 512]]
  - [-1, 1, C3k2, [256, False]]
  - [-1, 1, ECA, [256]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [256, 256]]
  - [-1, 1, C3k2, [128, False]]
  - [-1, 1, ECA, [128]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [128, 256]]
  - [-1, 1, C3k2, [256, False]]
  - [-1, 1, ECA, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [256, 512]]
  - [-1, 1, C3k2, [512, False]]
  - [-1, 1, ECA, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [512, 512]]
  - [-1, 1, C3k2, [512, True]]
  - [-1, 1, ECA, [512]]

  - [[25, 30, 35, 40], 1, Detect, [nc]]
